src/cfd/templates/inter/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions [0 1 -1 0 0 0 0];
internalField uniform ({{SPEED}} 0 0);
boundaryField
{
    inletWater { type fixedValue; value uniform ({{SPEED}} 0 0); }
    inletAir   { type fixedValue; value uniform ({{SPEED}} 0 0); }  // 공기도 같이 흐름
    outlet   { type inletOutlet; inletValue uniform (0 0 0); value $internalField; }
    side     { type slip; }
    bottom   { type slip; }
    top      { type slip; }
    symmetry { type symmetryPlane; }
    hull     { type noSlip; }
}
