src/cfd/templates/inter/0/alpha.water
FoamFile { version 2.0; format ascii; class volScalarField; object alpha.water; }
dimensions [0 0 0 0 0 0 0];
internalField uniform 0;
boundaryField
{
    inletWater { type fixedValue; value uniform 1; }   // 수면 아래만 물 주입 (침수 버그 수리)
    inletAir   { type inletOutlet; inletValue uniform 0; value uniform 0; }
    outlet     { type zeroGradient; }
    side       { type zeroGradient; }
    bottom     { type zeroGradient; }
    top        { type inletOutlet; inletValue uniform 0; value uniform 0; }
    symmetry   { type symmetryPlane; }
    hull       { type zeroGradient; }
}
