src/cfd/templates/inter/0/p_rgh
FoamFile { version 2.0; format ascii; class volScalarField; object p_rgh; }
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
    inletWater { type fixedFluxPressure; value uniform 0; }
    inletAir   { type fixedFluxPressure; value uniform 0; }
    outlet     { type zeroGradient; }
    side       { type fixedFluxPressure; value uniform 0; }
    bottom     { type fixedFluxPressure; value uniform 0; }
    top        { type totalPressure; p0 uniform 0; value uniform 0; }
    symmetry   { type symmetryPlane; }
    hull       { type fixedFluxPressure; value uniform 0; }
}
