src/cfd/templates/inter/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers
{
    "alpha.water.*"
    {
        nAlphaCorr 2; nAlphaSubCycles 1; cAlpha 1;
        MULESCorr yes; nLimiterIter 3;
        solver smoothSolver; smoother symGaussSeidel;
        tolerance 1e-8; relTol 0;
    }
    "pcorr.*" { solver PCG; preconditioner DIC; tolerance 1e-5; relTol 0; }
    p_rgh     { solver GAMG; smoother DIC; tolerance 1e-7; relTol 0.05; }
    p_rghFinal { $p_rgh; relTol 0; }
    "(U|k|omega).*" { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-6; relTol 0; }
}
PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors 1;  nCorrectors 2;  nNonOrthogonalCorrectors 0;
}
relaxationFactors { equations { ".*" 1; } }
