src/cfd/templates/inter/system/setFieldsDict
FoamFile { version 2.0; format ascii; class dictionary; object setFieldsDict; }
defaultFieldValues ( volScalarFieldValue alpha.water 0 );
regions
(
    boxToCell
    {
        box ({{XMIN}} {{YMIN}} {{ZMIN}}) ({{XMAX}} {{YMAX}} 0);
        fieldValues ( volScalarFieldValue alpha.water 1 );
    }
);
